apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_usbotg.h
/* USBOTG register (virtual) addresses **************************************/

/* Device/host capability registers */

#define IMXRT_USBOTG_HCCR_BASE(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_HCCR_OFFSET)
#define IMXRT_USBOTG_CAPLENGTH(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_CAPLENGTH_OFFSET)
#define IMXRT_USBHOST_HCIVERSION(n)           (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_HCIVERSION_OFFSET)
#define IMXRT_USBHOST_HCSPARAMS(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_HCSPARAMS_OFFSET)
#define IMXRT_USBHOST_HCCPARAMS(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_HCCPARAMS_OFFSET)
#define IMXRT_USBDEV_DCIVERSION(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_DCIVERSION_OFFSET)
#define IMXRT_USBDEV_DCCPARAMS(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_DCCPARAMS_OFFSET)

/* Device/host operational registers */

#define IMXRT_USBOTG_HCOR_BASE(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_HCOR_OFFSET)
#define IMXRT_USBOTG_USBCMD(n)                (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_USBCMD_OFFSET)
#define IMXRT_USBOTG_USBSTS(n)                (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_USBSTS_OFFSET)
#define IMXRT_USBOTG_USBINTR(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_USBINTR_OFFSET)
#define IMXRT_USBOTG_FRINDEX(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_FRINDEX_OFFSET)
#define IMXRT_USBOTG_PERIODICLIST(n)          (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_PERIODICLIST_OFFSET)
#define IMXRT_USBOTG_DEVICEADDR(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_DEVICEADDR_OFFSET)
#define IMXRT_USBOTG_ASYNCLISTADDR(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_ASYNCLISTADDR_OFFSET)
#define IMXRT_USBOTG_ENDPOINTLIST(n)          (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_ENDPOINTLIST_OFFSET)
#define IMXRT_USBOTG_TTCTRL(n)                (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_TTCTRL_OFFSET)
#define IMXRT_USBOTG_BURSTSIZE(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_BURSTSIZE_OFFSET)
#define IMXRT_USBOTG_TXFILLTUNING(n)          (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_TXFILLTUNING_OFFSET)
#define IMXRT_USBOTG_BINTERVAL(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_BINTERVAL_OFFSET)
#define IMXRT_USBOTG_ENDPTNAK(n)              (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_ENDPTNAK_OFFSET)
#define IMXRT_USBOTG_ENDPTNAKEN(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_ENDPTNAKEN_OFFSET)
#define IMXRT_USBOTG_PORTSC1(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_PORTSC1_OFFSET)
#define IMXRT_USBOTG_OTGSC(n)                 (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_OTGSC_OFFSET)
#define IMXRT_USBOTG_USBMODE(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBOTG_USBMODE_OFFSET)

#define IMXRT_USBDEV_USBCMD(n)                (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_USBCMD_OFFSET)
#define IMXRT_USBDEV_USBSTS(n)                (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_USBSTS_OFFSET)
#define IMXRT_USBDEV_USBINTR(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_USBINTR_OFFSET)
#define IMXRT_USBDEV_FRINDEX(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_FRINDEX_OFFSET)
#define IMXRT_USBDEV_DEVICEADDR(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_DEVICEADDR_OFFSET)
#define IMXRT_USBDEV_ENDPOINTLIST(n)          (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPOINTLIST_OFFSET)
#define IMXRT_USBDEV_BURSTSIZE(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_BURSTSIZE_OFFSET)
#define IMXRT_USBDEV_BINTERVAL(n)             (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_BINTERVAL_OFFSET)
#define IMXRT_USBDEV_ENDPTNAK(n)              (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTNAK_OFFSET)
#define IMXRT_USBDEV_ENDPTNAKEN(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTNAKEN_OFFSET)
#define IMXRT_USBDEV_PORTSC1(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_PORTSC1_OFFSET)
#define IMXRT_USBDEV_USBMODE(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_USBMODE_OFFSET)

#define IMXRT_USBHOST_USBCMD(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_USBCMD_OFFSET)
#define IMXRT_USBHOST_USBSTS(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_USBSTS_OFFSET)
#define IMXRT_USBHOST_USBINTR(n)              (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_USBINTR_OFFSET)
#define IMXRT_USBHOST_FRINDEX(n)              (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_FRINDEX_OFFSET)
#define IMXRT_USBHOST_PERIODICLIST(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_PERIODICLIST_OFFSET)
#define IMXRT_USBHOST_ASYNCLISTADDR(n)        (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_ASYNCLISTADDR_OFFSET)
#define IMXRT_USBHOST_TTCTRL(n)               (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_TTCTRL_OFFSET)
#define IMXRT_USBHOST_BURSTSIZE(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_BURSTSIZE_OFFSET)
#define IMXRT_USBHOST_TXFILLTUNING(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_TXFILLTUNING_OFFSET)
#define IMXRT_USBHOST_BINTERVAL(n)            (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_BINTERVAL_OFFSET)
#define IMXRT_USBHOST_PORTSC1(n)              (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_PORTSC1_OFFSET)
#define IMXRT_USBHOST_USBMODE(n)              (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBHOST_USBMODE_OFFSET)

/* Device endpoint registers */

#define IMXRT_USBDEV_ENDPTSETUPSTAT(n)     (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTSETUPSTAT_OFFSET)
#define IMXRT_USBDEV_ENDPTPRIME(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTPRIME_OFFSET)
#define IMXRT_USBDEV_ENDPTFLUSH(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTFLUSH_OFFSET)
#define IMXRT_USBDEV_ENDPTSTATUS(n)        (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTSTATUS_OFFSET)
#define IMXRT_USBDEV_ENDPTCOMPLETE(n)      (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCOMPLETE_OFFSET)

#define IMXRT_USBDEV_ENDPTCTRL(n)          (IMXRT_USB_BASE + IMXRT_USBDEV_ENDPTCTRL_OFFSET(n))
#define IMXRT_USBDEV_ENDPTCTRL0(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL0_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL1(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL1_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL2(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL2_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL3(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL3_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL4(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL4_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL5(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL5_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL6(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL6_OFFSET)
#define IMXRT_USBDEV_ENDPTCTRL7(n)         (IMXRT_USB_BASE + (0x200 * (n)) + IMXRT_USBDEV_ENDPTCTRL7_OFFSET)

/* Device non-core registers */

#define IMXRT_USBNC_USB_OTG1_CTRL            (IMXRT_USB_BASE + IMXRT_USBNC_USB_OTG1_CTRL_OFFSET)
#define IMXRT_USBNC_USB_OTG1_PHY_CTRL_0      (IMXRT_USB_BASE + IMXRT_USBNC_USB_OTG1_PHY_CTRL_0_OFFSET)

