apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_usbotg.h
#define USBDEV_ENDPTCTRL_TXS                 (1 << 16) /* Bit 16: Tx endpoint stall */
#define USBDEV_ENDPTCTRL_RXE                 (1 << 7)  /* Bit 7:  Rx endpoint enable */
#define USBDEV_ENDPTCTRL_RXR                 (1 << 6)  /* Bit 6:  Rx data toggle reset */
#define USBDEV_ENDPTCTRL_RXI                 (1 << 5)  /* Bit 5:  Rx data toggle inhibit */
#define USBDEV_ENDPTCTRL_RXT_SHIFT           (2)       /* Bits 2-3: Endpoint type */
#define USBDEV_ENDPTCTRL_RXT_MASK            (3 << USBDEV_ENDPTCTRL_RXT_SHIFT)
#  define USBDEV_ENDPTCTRL_RXT_CTRL          (0 << USBDEV_ENDPTCTRL_RXT_SHIFT) /* Control */
#  define USBDEV_ENDPTCTRL_RXT_ISOC          (1 << USBDEV_ENDPTCTRL_RXT_SHIFT) /* Isochronous */
#  define USBDEV_ENDPTCTRL_RXT_BULK          (2 << USBDEV_ENDPTCTRL_RXT_SHIFT) /* Bulk */
#  define USBDEV_ENDPTCTRL_RXT_INTR          (3 << USBDEV_ENDPTCTRL_RXT_SHIFT) /* Interrupt */

#define USBDEV_ENDPTCTRL_RXS                 (1 << 0)  /* Bit 0:  Rx endpoint stall */

/* Device non-core registers */

/* USB OTG Control register */

/*                                                       Bits 0-6:
 *                                                             Reserved
 */
#define USBNC_OVER_CUR_DIS                   (1 <<  7) /* Bit  7: Disable Over current detection */
#define USBNC_OVER_CUR_POL                   (1 << 8)  /* Bit  8: Polarity of over current */
#define USBNC_PWR_POL                        (1 << 9)  /* Bit  9: Power polarity */
#define USBNC_WIE                            (1<< 10)  /* Bit 10: Wake up interrupt enable */
                                                       /* Bit 11-13: Reserved */
#define USBNC_WKUP_SW_EN                     (1 << 14) /* Bit 14: Software wake up enable */
#define USBNC_WKUP_SW                        (1 << 15) /* Bit 15: Software wake up */
#define USBNC_WKUP_ID_EN                     (1 << 16) /* Bit 16: Wakeup on ID change enable */
#define USBNC_WKUP_VBUS_EN                   (1 << 17) /* Bit 17: Wakeup on VBUS change enable */
                                                       /* Bit 18-28: Reserved */
#define USBNC_WKUP_DPDM_EN                   (1 << 29) /* Bit 29: Wakeup on DPDM change enable */
                                                       /* Bit 30: Reserved */
#define USBNC_WIR                            (1 << 31) /* Bit 31: Wake up interrupt request */

/* USB VBUS 3.0 Regulator */

#define IMXRT_PMU_REG_3P0                    0x120

#define PMU_REG_3P0_OUTPUT_TRG_SHIFT         (8)
#define PMU_REG_3P0_OUTPUT_TRG_MASK          (0x1f << PMU_REG_3P0_OUTPUT_TRG_SHIFT)
#define PMU_REG_3P0_OUTPUT_TRG(x)            (x << PMU_REG_3P0_OUTPUT_TRG_SHIFT)

#define PMU_REG_3P0_ENABLE_LINREG            (1 << 0)

#define IMXRT_USBVBUS_REG_3P0                (IMXRT_ANATOP_BASE + IMXRT_PMU_REG_3P0)

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_USBOTG_H */
